common/models/User.php

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM "user" WHERE ("username"='admin') AND ("status"=10)